app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 17)
INSERT INTO "comments" ("created_at", "body", "uncheer", "updated_at", "post_id", "cheer", "commenter", "user_id") VALUES('2010-09-30 00:52:49', 'flkjaljdl', 0, '2010-09-30 00:52:49', 17, 0, NULL, NULL)
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "comments" SET "updated_at" = '2010-09-30 00:39:24', "commenter" = 0 WHERE "id" = 2
---
  def create
    @post = Post.find(params[:post_id])

    @comment = @post.comments.create!(params[:comment])
    @comment.update_attribute(:user_id,User.find_by_id(session[:user_id]).id)