app/controllers/comment_cheer_controller.rb

  def cheer
    @cheers = CommentCheer.find_by_comment_id_and_user_id(params[:id],session[:user_id])
    @comment = Comment.find(params[:id])

    if @comment.user_id == session[:user_id]
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You can't cheer your own comment!!") }
      end
      return
    end

    if @cheers and @cheers.user_id == session[:user_id] and @cheers.cheer == 1
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already cheered this comment!!") }
      end
      return
    end

    if @cheers and @cheers.user_id == session[:user_id] and @cheers.cheer == 0
     respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already uncheered this comment!!") }
      end
      return
    end


    @cheers = @comment.comment_cheers.create!
    @cheers.update_attribute(:user_id,User.find_by_id(session[:user_id]).id )
---
SELECT * FROM "comment_cheers" WHERE ("comment_cheers"."comment_id" = '11' AND "comment_cheers"."user_id" = 20) LIMIT 1
SELECT * FROM "comments" WHERE ("comments"."id" = 5)
INSERT INTO "comment_cheers" ("created_at", "uncheer", "updated_at", "cheer", "user_id", "comment_id") VALUES('2010-09-30 19:24:00', 0, '2010-09-30 19:24:00', 0, NULL, 5)
SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
UPDATE "comment_cheers" SET "updated_at" = '2010-09-30 19:24:01', "user_id" = 3 WHERE "id" = 1
UPDATE "comments" SET "updated_at" = '2010-09-30 19:35:28', "cheer" = 1 WHERE "id" = 6

  def uncheer
 @uncheers = CommentCheer.find_by_comment_id_and_user_id(params[:id],session[:user_id])
    @comment = Comment.find(params[:id])

    if @comment.user_id == session[:user_id]
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You can't uncheer your own comment!!") }
      end
      return
    end

    if @uncheers and @uncheers.user_id == session[:user_id] and @uncheers.uncheer == 1
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already uncheered this comment!!") }
      end
      return
    end

    if @uncheers and @uncheers.user_id == session[:user_id] and @uncheers.uncheer == 0
     respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already cheered this comment!!") }
      end
      return
    end


    @uncheers = @comment.comment_cheers.create!
    @uncheers.update_attribute(:user_id,User.find_by_id(session[:user_id]).id )
---
SELECT * FROM "comment_cheers" WHERE ("comment_cheers"."comment_id" = '11' AND "comment_cheers"."user_id" = 21) LIMIT 1
SELECT * FROM "comments" WHERE ("comments"."id" = 5)
INSERT INTO "comment_cheers" ("created_at", "uncheer", "updated_at", "cheer", "user_id", "comment_id") VALUES('2010-09-30 19:36:32', 0, '2010-09-30 19:36:32', 0, NULL, 7)
SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1
UPDATE "comment_cheers" SET "updated_at" = '2010-09-30 19:36:32', "user_id" = 5 WHERE "id" = 3
UPDATE "comments" SET "updated_at" = '2010-09-30 19:36:33', "uncheer" = 1 WHERE "id" = 7