app/controllers/posts_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
---
  def new
    @post = Post.new#(User.find_by_id(session[:user_id]).name)

SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
UPDATE "posts" SET "updated_at" = '2010-10-01 00:02:48', "name" = 'jayaram' WHERE "id" = 27
INSERT INTO "posts" ("name", "created_at", "title", "uncheer", "updated_at", "cheer", "user_id", "content") VALUES(NULL, '2010-09-30 00:20:48', 'fldjlfdjld', 0, '2010-09-30 00:20:48', 0, NULL, 'dhfkldjlal')
---
  def create
    @post = Post.new(params[:post])
    @post.update_attribute(:user_id,User.find_by_id(session[:user_id]).id)
    @post.write_attribute(:name, User.find_by_id(session[:user_id]).name)
   # @post.update_attribute(:name => User.find_by_id(session[:user_id]).name)

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 6)
UPDATE "posts" SET "updated_at" = '2010-09-29 23:12:34', "title" = 'dljlddkjl', "content" = 'fdnld' WHERE "id" = 6
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])