app/controllers/post_cheer_controller.rb

SELECT * FROM "post_cheers" WHERE ("post_cheers"."user_id" = 5 AND "post_cheers"."post_id" = '22') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 19)
INSERT INTO "post_cheers" ("created_at", "uncheer", "updated_at", "post_id", "cheer", "user_id") VALUES('2010-09-30 03:02:12', NULL, '2010-09-30 03:02:12', 19, NULL, NULL)
SELECT * FROM "post_cheers" WHERE ("post_cheers"."post_id" = '22') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "post_cheers" SET "updated_at" = '2010-09-30 03:02:12', "user_id" = 3 WHERE "id" = 1
UPDATE "posts" SET "updated_at" = '2010-09-30 19:34:06', "cheer" = 1 WHERE "id" = 25
---
  def cheer
    @cheers = PostCheer.find_by_post_id_and_user_id(params[:id],session[:user_id])
    @post = Post.find(params[:id])

    if @post.user_id == session[:user_id]
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You can't cheer your own post!!") }
      end
      return
    end

    if @cheers and @cheers.user_id == session[:user_id] and @cheers.cheer == 1
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already cheered this post!!") }
      end
      return
    end

    if @cheers and @cheers.user_id == session[:user_id] and @cheers.cheer == 0
     respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already uncheered this post!!") }
      end
      return
    end


    @cheers = @post.post_cheers.create!
    @cheers.update_attribute(:user_id,User.find_by_id(session[:user_id]).id )

SELECT * FROM "post_cheers" WHERE ("post_cheers"."user_id" = 5 AND "post_cheers"."post_id" = '22') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 22)
INSERT INTO "post_cheers" ("created_at", "uncheer", "updated_at", "post_id", "cheer", "user_id") VALUES('2010-09-30 04:28:53', 0, '2010-09-30 04:28:53', 22, 0, NULL)
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "post_cheers" SET "updated_at" = '2010-09-30 04:31:05', "uncheer" = 1 WHERE "id" = 5
UPDATE "posts" SET "updated_at" = '2010-09-30 04:28:53', "uncheer" = 1 WHERE "id" = 22
---
  def uncheer
    @uncheers = PostCheer.find_by_post_id_and_user_id(params[:id],session[:user_id])
    @post = Post.find(params[:id])

    if @post.user_id == session[:user_id]
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You can't uncheer your own post!!") }
      end
      return
    end

    if @uncheers and @uncheers.user_id == session[:user_id] and @uncheers.uncheer == 1
      respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already uncheered this post!!") }
      end
      return
    end

    if @uncheers and @uncheers.user_id == session[:user_id] and @uncheers.uncheer == 0
     respond_to do |format|
         format.html { redirect_to(:back, :notice => "You already cheered this post!!") }
      end
      return
    end


    @uncheers = @post.post_cheers.create!
    @uncheers.update_attribute(:user_id,User.find_by_id(session[:user_id]).id )