app/controllers/search_controller.rb

SELECT * FROM "posts" WHERE (content LIKE '%vi%' OR title LIKE '%vi%' OR name LIKE '%vi%')
---
  def live_search_post

   if params[:query].empty?
     @user_post
     render(:layout => false)
     return
    end


    @user_post = Post.find(:all,:conditions => ["content LIKE ? OR title LIKE ? OR name LIKE ?",
                              "%#{params[:query]}%","%#{params[:query]}%","%#{params[:query]}%"])

SELECT * FROM "users" WHERE (name LIKE '%vina%')
---
  def live_search_user
    if params[:query].empty?
     @users
     render(:layout => false)
     return
   end

   @users = User.find(:all,:conditions => ["name LIKE ?", "%#{params[:query]}%"])