app/controllers/users_controller.rb

SELECT "users".id FROM "users" WHERE ("users"."name" = 'aditya' AND "users".id <> 14) LIMIT 1
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "privilege") VALUES('aditya', '565355280.950384829559198', '2010-10-01 13:25:04', '2010-10-01 13:25:04', 'd651c621850f1b6db0d616a932cb85b3d59cde34', 1)
---
  def create
    @user = User.new(params[:user])

    if session[:user_id]!= nil and  User.find_by_name(User.find(session[:user_id]).name).privilege == 1
      @user.update_attribute(:privilege, 1)
    end


    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 15) LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."name" = 'a')
DELETE FROM "posts" WHERE "id" = 2
DELETE FROM "users" WHERE "id" = 2
---
  def destroy
    @user = User.find(params[:id])

    @posts=Post.find_all_by_name(@user.name)
    @posts.each do |post|
      post.destroy
    end
    @user.destroy